# Ohmyzsh Theme and Plugins
tap "romkatv/powerlevel10k"
brew "zsh-autosuggestions"
brew "zsh-syntax-highlighting"
brew "romkatv/powerlevel10k/powerlevel10k"
cask "font-meslo-for-powerlevel10k"

# Tooling
brew "asdf"
brew "autojump"
brew "curl"
brew "fzf"
brew "git"
brew "httpie"
brew "jq"
brew "rcm"
brew "tldr"
brew "tree"
brew "watch"
brew "yq"

# AWS
tap "aws/tap"
brew "aws-iam-authenticator"
brew "awscli"
cask "aws-vault"
brew "ec2-instance-selector"
cask "session-manager-plugin"

# Kubernetes
brew "k9s"

# Container Tools
brew "dive"

# Load Testing
brew "siege"

# Desktop Tools
cask "docker"
cask "iterm2"
cask "rectangle"
