# Ohmyzsh Theme and Plugins
brew "powerlevel10k"
brew "zsh-autosuggestions"
brew "zsh-syntax-highlighting"
cask "font-meslo-for-powerlevel10k"

# Tooling
cask "1password-cli"
brew "asdf"
brew "autojump"
brew "ca-certificates"
brew "curl"
brew "fzf"
brew "git"
brew "httpie"
brew "jq"
brew "prettyping"
brew "rcm"
brew "tlrc"
brew "tree"
brew "watch"
brew "yq"

# AWS
brew "aws-iam-authenticator"
brew "awscli"
cask "aws-vault"
brew "ec2-instance-selector"
cask "session-manager-plugin"

# Kubernetes
brew "k9s"
brew "kube-capacity"

# Container Tools
brew "dive"

# Load Testing
brew "siege"

# Desktop Tools
cask "alt-tab"
cask "docker-desktop"
cask "iterm2"
cask "jordanbaird-ice"
cask "keybase"
cask "lunar"
cask "meetingbar"
cask "obsidian"
cask "raindropio"
